#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура УстановитьСтатусЗаказаИМ(ЗаказКлиента, Статус) Экспорт

	ЗаказОбъект = ЗаказКлиента.ПолучитьОбъект();
	
	ЗаказОбъект.Статус = Статус;
	
	МенеджерОшибок = Новый МенеджерОбработкиОшибок;
	Попытка

		ЗаказОбъект.Записать();
		
	Исключение

		ВызватьИсключение МенеджерОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());

	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#КонецЕсли