///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Компонента последней версии.
// 
// Параметры:
//  Идентификатор - Строка - идентификатор компоненты.
//  Местоположение - Строка - местоположение макета компоненты (без указания версии).
//  ВнешняяКомпонента - Неопределено
//                    - Структура - данные внешней компоненты:
//                       * Идентификатор - Строка - идентификатор компоненты в справочнике.
//                       * Версия - Строка - версия.
//                       * Местоположение - Строка - местоположение.
//                       * Доступна - Булево - признак доступности.
//
// Возвращаемое значение:
//  Структура - компонента последней версии из справочника или макета:
//   * Идентификатор - Строка - идентификатор компоненты в справочнике.
//   * Местоположение - Строка - макет компоненты, адрес ссылки в справочнике.
//   * Версия - Строка - версия.
//
Функция КомпонентаПоследнейВерсии(Идентификатор, Местоположение, ВнешняяКомпонента = Неопределено) Экспорт
		
	КомпонентаПоследнейВерсии = Новый Структура;
	КомпонентаПоследнейВерсии.Вставить("Идентификатор", Идентификатор);
	КомпонентаПоследнейВерсии.Вставить("Местоположение", "");
	КомпонентаПоследнейВерсии.Вставить("Версия", "");
	
	// Информация о внешней компоненте.
	Если ВнешняяКомпонента <> Неопределено И ВнешняяКомпонента.Доступна Тогда
		ПоследняяВерсияВнешнейКомпоненты = Новый Структура("Версия, Местоположение", 
			ВнешняяКомпонента.Версия, ВнешняяКомпонента.Местоположение);
	Иначе
		ПоследняяВерсияВнешнейКомпоненты = Неопределено;
	КонецЕсли;
	
	// Информация о компоненте из макета.
	Если ЗначениеЗаполнено(Местоположение) Тогда
		ПоследняяВерсияКомпонентыИзМакета = СтандартныеПодсистемыПовтИсп.ПоследняяВерсияКомпонентыИзМакета(
			Местоположение);
	Иначе
		ПоследняяВерсияКомпонентыИзМакета = Неопределено;
	КонецЕсли;
	
	Если ПоследняяВерсияВнешнейКомпоненты <> Неопределено И ПоследняяВерсияКомпонентыИзМакета <> Неопределено Тогда
		Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(ПоследняяВерсияВнешнейКомпоненты.Версия,
				ПоследняяВерсияКомпонентыИзМакета.Версия) > 0 Тогда
			ЗаполнитьЗначенияСвойств(КомпонентаПоследнейВерсии, ПоследняяВерсияВнешнейКомпоненты);
			Возврат КомпонентаПоследнейВерсии;
		Иначе
			ЗаполнитьЗначенияСвойств(КомпонентаПоследнейВерсии, ПоследняяВерсияКомпонентыИзМакета);
			Возврат КомпонентаПоследнейВерсии;
		КонецЕсли;
	ИначеЕсли ПоследняяВерсияКомпонентыИзМакета <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(КомпонентаПоследнейВерсии, ПоследняяВерсияКомпонентыИзМакета);
		Возврат КомпонентаПоследнейВерсии;
	ИначеЕсли ПоследняяВерсияВнешнейКомпоненты <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(КомпонентаПоследнейВерсии, ПоследняяВерсияВнешнейКомпоненты);
		Возврат КомпонентаПоследнейВерсии;
	КонецЕсли;
	
	ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Не существует внешняя компонента с идентификатором %1'", "ru"), Идентификатор);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
